src/InformationRegisters/__СоответствияОбъектовИБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>__СоответствияОбъектовИБ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объект3</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.__ТипСоответствияОбъектовИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект1</Name>
					<Comment>Объект из сопряженной системы</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект2</Name>
					<Comment>Объект из базы УХ</Comment>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/__СоответствияОбъектовИБ/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой()									// новый
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// копирование
		
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		ОбъектОбязателен = Параметры.ЗначенияЗаполнения.Количество() > 0 И Параметры.ЗначенияЗаполнения.Свойство("Объект1");
		Элементы.Объект1.ТолькоПросмотр = ОбъектОбязателен;
		
	ИначеЕсли Параметры.Ключ.Пустой()								// новый
		И Параметры.ЗначенияЗаполнения.Количество() > 0				// заполняется при переходе из объекта
		И Параметры.ЗначенияЗаполнения.Свойство("Объект1")			// есть свойство
		И НЕ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда	// не копирование
		
		ТипОбъект1 = ТипЗнч(Параметры.ЗначенияЗаполнения.Объект1);
		ДанныеИзменены = Ложь;
		
		Если ДанныеИзменены Тогда
			
			Элементы.Объект2.ВыбиратьТип = Ложь;
			Элементы.Объект1.ВыбиратьТип = Ложь;
			Элементы.Объект1.ТолькоПросмотр = Истина;
			Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НЕ Параметры.Ключ.Пустой()
		И ЭтаФорма.ВладелецФормы.Родитель.Окно.Содержимое.Количество() > 1 Тогда
		// Форма открывается из Объекта1
		
		Элементы.Объект2.ВыбиратьТип = Ложь;
		Элементы.Объект1.ВыбиратьТип = Ложь;
		Элементы.Объект1.ТолькоПросмотр = Истина;
		Элементы.ТипСоответствия.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы
